Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: While using the `checkpoint` commit-strategy, specify the max age in milliseconds that the processing state must be persisted before the connector is marked as unhealthy. Setting this attribute to `0` disables this monitoring. Type: _int_
ja_jp: checkpoint` コミット戦略を使用する場合、コネクタが不健全とマークされる前に処理状態を保持する必要がある最大時間をミリ秒単位で指定します。この属性を `0` に設定すると、この監視を無効にすることができます。 Type: _int_

source: While using the `checkpoint` commit-strategy, the fully qualified type name of the state object to persist in the state store. When provided, it can be used by the state store implementation to help persisting the processing state object. Type: _string_
ja_jp: `checkpoint` commit-strategy を使用する場合、ステートストアに永続化するステートオブジェクトの完全修飾型名を指定します。指定されると、処理ステートオブジェクトの永続化を助けるために、ステートストア実装によって使用されることができます。

source: While using the `checkpoint` commit-strategy, the name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.StateStore.Factory` to specify the state store implementation. Type: _string_
ja_jp: `checkpoint` コミット戦略を使用している間、 `io.smallrye.reactive.messaging.kafka.StateStore.Factory` を実装する Bean の `@Identifier` に設定された名前は、状態ストアの実装を指定します。 Type: _string_

source: While using the `throttled` commit-strategy, specify the max age in milliseconds that an unprocessed message can be before the connector is marked as unhealthy. Setting this attribute to 0 disables this monitoring. Type: _int_
ja_jp: `throttled` commit-strategy を使用している場合の、コネクタが不健全であるとマークされるまでの未処理メッセージの最大時間をミリ秒単位で指定します。この属性を 0 に設定すると、このモニタリングが無効になります。 Type: _int_

source: While we had support for configuration profiles through property prefixing (eg. `%dev.name`), we now also support profile-aware files. We've added support for this, and many other features part of the MicroProfile 2.0 release.
ja_jp: これまで、プロパティのプレフィックス（例： `%dev.name` ）によって設定プロファイルをサポートしていましたが、今回、プロファイルを意識したファイルもサポートするようになりました。MicroProfile 2.0 のリリースでは、この他にも多くの機能をサポートするようになりました。

source: While we had support for configuration profiles through property prefixing (eg. `%dev.name`), we now also support profile-aware files. We’ve added support for this, and many other features part of the MicroProfile 2.0 release.
ja_jp: これまでにも、プロパティのプレフィックスによる設定プロファイルをサポートしていましたが（例： `%dev.name` ）、今回、プロファイルを意識したファイルもサポートするようになりました。MicroProfile 2.0 のリリースでは、この他にも多くの機能をサポートするようになりました。

source: While we know it is impossible to make everyone happy, we hope we have at least managed to acheive a pattern for configuration that leads to more predictable and consistent results. And we apologize (again), for any behavior changes you may have observed as we sorted this out.
ja_jp: すべての人を幸せにすることは不可能であることはわかっていますが、少なくとも、より予測可能で一貫性のある結果につながる設定のパターンを達成することができたことを願っています。また、この問題を解決した際に観察された挙動の変化については、（再度）お詫び申し上げます。

source: While we recommend you to avoid short names and always use fully specified names including the registry, Testcontainers unfortunately relies on short names internally for the time being. If you are using Testcontainers, either directly or through Dev Services, you need to disable this prompt by setting the `short-name-mode="disabled"` configuration property of Podman in `/etc/containers/registries.conf`.
ja_jp: 略称の使用は避けて、レジストリーを含め常に完全に指定された名前を使うことをお勧めしますが、残念ながら現時点で Testcontainers は内部的に略称に依存しています。もし Testcontainers を直接または Dev Services を通して使用している場合、 `/etc/containers/registries.conf` で Podman の `short-name-mode="disabled"` 設定プロパティーを設定して、このプロンプトを無効にする必要があります。

source: While we recommend you to follow the step-by-step instructions, you can find the final solution on https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-reactive-panache-quickstart.
ja_jp: ステップバイステップの手順に従うことをお勧めしますが、最終的なソリューションは https://github.com/quarkusio/quarkus-quickstarts/tree/main/hibernate-reactive-panache-quickstart で見つけることができます。

source: While writing native application you'll need to define proxy classes at image build time by specifying the list of interfaces that they implement.
ja_jp: ネイティブアプリケーションを書く際には、実装するインターフェースのリストを指定して、イメージのビルド時にプロキシークラスを定義する必要があります。

source: While you are encouraged to use CDI annotations for injection, Quarkus provides a compatibility layer for Spring dependency injection in the form of the spring-di extension.
ja_jp: インジェクションにはCDIアノテーションを使用することが推奨されていますが、Quarkusはspring-diエクステンションの形でSpring依存性インジェクション用の互換性レイヤーを提供しています。

source: While you are encouraged to use Hibernate ORM with Panache for your data layer, Quarkus provides a compatibility layer for Spring Data JPA in the form of the spring-data-jpa extension.
ja_jp: データレイヤーにはHibernate ORM with Panacheを使用することが推奨されていますが、Quarkusはspring-data-jpaエクステンションの形でSpring Data JPAの互換性レイヤーを提供しています。

source: While you are encouraged to use JAX-RS annotations for defining REST endpoints, Quarkus provides a compatibility layer for Spring Web in the form of the spring-web extension.
ja_jp: RESTエンドポイントの定義にはJAX-RSアノテーションを使用することが推奨されていますが、QuarkusはSpring-webエクステンションという形でSpring Webとの互換性のあるレイヤーを提供しています。

source: While you are encouraged to use Jakarta REST annotations for defining REST endpoints, Quarkus provides a compatibility layer for Spring Web in the form of the spring-web extension.
ja_jp: RESTエンドポイントの定義にはJakarta RESTアノテーションを使用することが推奨されていますが、QuarkusはSpring-webエクステンションという形でSpring Webとの互換性のあるレイヤーを提供しています。

source: While you are encouraged to use the Cache extension for your application-level caching, Quarkus provides a compatibility layer for Spring Cache in the form of the spring-cache extension.
ja_jp: アプリケーションレベルのキャッシングにはCacheエクステンションを使用することが推奨されていますが、QuarkusはSpring Cacheエクステンションの形でSpring Cacheの互換性レイヤーを提供しています。

source: While you are encouraged to use the Quarkus Security layer to secure your applications, Quarkus provides a compatibility layer for Spring Security in the form of the spring-security extension.
ja_jp: Quarkus Securityレイヤーを使用してアプリケーションを保護することが推奨されていますが、Quarkusはspring-securityのエクステンションの形でSpring Securityとの互換性のあるレイヤーを提供しています。

source: While you are encouraged to use the Quarkus security layer to secure your applications, Quarkus provides a compatibility layer for Spring Security in the form of the spring-security extension.
ja_jp: Quarkusのセキュリティレイヤーを使用してアプリケーションを保護することが推奨されていますが、Quarkusはspring-securityのエクステンションの形でSpring Securityとの互換性のあるレイヤーを提供しています。

source: While you are encouraged to use the Scheduler or Quartz extensions to schedule tasks, Quarkus provides a compatibility layer for Spring Scheduled in the form of the spring-scheduled extension.
ja_jp: SchedulerやQuartzのエクステンションを使ってタスクをスケジュールすることが推奨されていますが、QuarkusはSpring-scheduledエクステンションの形でSpring Scheduledとの互換性のあるレイヤーを提供しています。

source: While you are in your build file, add the following dependency:
ja_jp: ビルドファイルの中で、以下の依存関係を追加してください。

source: While you can use a self-signed certificate for local development, it has limitations. Browsers and tools like `curl`, `wget`, and `httpie` typically do not trust self-signed certificates, requiring manual import of the CA in your OS.
ja_jp: ローカル開発には自己署名証明書を使用できますが、制限があります。 通常、 `curl`、 `wget`、 `httpie` などのブラウザーやツールは、自己署名証明書を信頼しないため、OS に CA を手動でインポートする必要があります。

source: While you can use a self-signed certificate for local development, it has limitations. Browsers and tools like `curl`, `wget`, and `httpie` typically do not trust self-signed certificates, requiring manual import of the CA in your operating system.
ja_jp: ローカル開発には自己署名証明書を使用できますが、制限があります。 通常、`curl`、`wget`、`httpie` などのブラウザーやツールは、自己署名証明書を信頼しないため、オペレーティングシステムに CA を手動でインポートする必要があります。

source: While you can use a self-signed certificate for local development, it has limitations. Browsers and tools like `curl`, `wget`, and `httpie` typically do not trust self-signed certificates, so you need to import the CA into your operating system manually.
ja_jp: ローカル開発に自己署名証明書を使用できますが、制限があります。 `curl` 、 `wget` 、 `httpie` などのブラウザーやツールは通常、自己署名証明書を信頼しないため、OS に CA を手動でインポートする必要があります。

source: While you can use https://vertx.io/docs/vertx-web/java/#_routing_by_http_method[any Vert.x handler], the `DevConsolePostHandler` superclass will handle your POST actions nicely, and auto-redirect to the `GET` URI right after your `POST` for optimal behavior.
ja_jp: link:https://vertx.io/docs/vertx-web/java/#_routing_by_http_method[どのVert.x ハンドラー] でも使用することができますが、 `DevConsolePostHandler` スーパークラスは POST アクションをうまく処理し、最適な動作を実現するために `POST` の直後に `GET` URI に自動リダイレクトします。

source: While you can use the Vert.x API to register consumers, Quarkus comes with declarative support. To consume events, use the `io.quarkus.vertx.ConsumeEvent` annotation:
ja_jp: Vert.x APIを使用してコンシューマーを登録することができますが、Quarkusには宣言型のサポートがあります。イベントを消費するには、 `io.quarkus.vertx.ConsumeEvent` アノテーションを使用します。

source: While, at the moment, there are no reliable ways to detect monopolization, there are mechanisms to detect pinning.
ja_jp: 今のところ、独占を検知する確実な方法はないが、ピン止めを検知するメカニズムはある。

source: Who would need a time zone in a server application, right? For instance, your logging layer, which wants to print timestamps in the local time zone.
ja_jp: サーバーアプリケーションでタイムゾーンを必要とする人なんているでしょうか？たとえば、ローカルのタイムゾーンでタイムスタンプを出力したいロギングレイヤーなどがそうです。

source: Why 1.0 Matters
ja_jp: 1.0が重要である理由

source: Why Bother
ja_jp: なぜわざわざ

source: Why Elasticsearch only?
ja_jp: なぜElasticsearchだけなのか?

source: Why Quarkus-specific tooling?
ja_jp: Quarkus 固有ツールを使用する理由

source: Why Quarkus?
ja_jp: なぜQuarkusなのか？

source: Why always having a transaction manager?
ja_jp: なぜ常にトランザクションマネージャーを持っているのか?

source: Why an extension framework
ja_jp: なぜエクステンションフレームワークなのか

source: Why another reactive programming API?
ja_jp: なぜ別のリアクティブプログラミングAPIなのか？

source: Why are native executables “big”?
ja_jp: なぜネイティブ実行可能ファイルは大きいのですか？

source: Why are these API shaping rules important? Vert.x does not provide a single API. The "bare" API presented above is just one of the proposed API. It also provides API in Kotlin, API for RX Java, and so on.
ja_jp: なぜこれらの API シェーピングルールが重要なのか?Vert.xは単一のAPIを提供していません。上で紹介した「素の」APIは、提案されているAPIの1つに過ぎません。他にもKotlinでのAPIやRX JavaでのAPIなども提供されています。

source: Why didn't it work?
ja_jp: なぜうまくいかなかったのでしょうか?

source: Why didn't we just link to the benchmark source code? Historically, we've been deliberately vague about what we were comparing against (manners!). Sharing the source code would have made it totally obvious what the other framework was. As well as preventing us from the sharing of the benchmark source, anonymizing the other framework had its own problems. Not sharing the framework name is polite, but it means we're not giving readers useful information to make an informed choice of framework. Is Quarkus better? Oh yes, definitely. Better than what? Shhh, that's a secret.
ja_jp: なぜベンチマークのソースコードにリンクしなかったのでしょうか？歴史的に、私たちは比較対象について意図的に曖昧にしてきました（マナーの問題！）。ソースコードを共有すれば、他のフレームワークが何であるかが完全に明らかになっていたでしょう。ベンチマークのソース共有を妨げるだけでなく、他のフレームワークを匿名化することにはそれ自体の問題がありました。フレームワーク名を共有しないことは丁寧ですが、読者に情報に基づいたフレームワークの選択をするための有用な情報を提供しないことになります。Quarkusの方が優れているのか？ああ、はい、間違いなく。何よりも優れているのか？シーッ、それは秘密です。

source: Why do you prefer JTA vs Hibernate's transaction management API
ja_jp: Hibernateのトランザクション管理APIではなくJTAを好む理由

source: Why does Quarkus detect and remove unused beans by default?
ja_jp: Quarkusがデフォルトで未使用のBeanを検出して削除するのはなぜですか？

source: Why does Quarkus want to gather usage analytics?
ja_jp: Quarkusが使用状況分析を収集する理由は何ですか？

source: Why does RESTEasy Reactive using @Blocking perform better than RESTEasy Classic?
ja_jp: なぜ @Blocking を使用した RESTEasy Reactive は RESTEasy Classic よりもパフォーマンスが良いのですか?

source: Why follow this process
ja_jp: このプロセスに従う理由

source: Why is Quarkus a very good option for Web Applications compared to other frameworks?
ja_jp: 他のフレームワークと比較して、Quarkus が Web アプリケーションにとって非常に優れた選択肢であるのはなぜですか?

source: Why is `quarkus-rest` not resolved?
ja_jp: `quarkus-rest` が解決されないのはなぜですか?

source: Why is `quarkus-resteasy-reactive` not resolved?
ja_jp: `quarkus-resteasy-reactive` が解決されない理由

source: Why is `quarkus-resteasy` not resolved?
ja_jp: `quarkus-resteasy` が解決されないのはなぜですか?

source: Why is reading annotations so costly? Because parsing them has a cost. It happens the first time you try to access them at runtime, and the JDK then creates proxy instances to expose the annotation values.
ja_jp: なぜアノテーションの読み込みはこれほどコストがかかるのでしょうか？それは、アノテーションの解析にコストがかかるからです。これは実行時に初めてアクセスを試みたときに発生し、JDK はアノテーションの値を公開するためのプロキシインスタンスを作成します。

source: Why is runtime performance of a native executable inferior compared to JVM mode?
ja_jp: JVMモードと比較して、ネイティブ実行可能ファイルのランタイムパフォーマンスが劣るのはなぜですか？

source: Why is the `main` method there?
ja_jp: `main` メソッドが存在する理由

source: Why is the process of generating a native executable slow?
ja_jp: ネイティブ実行可能ファイルを生成するプロセスが遅いのはなぜですか？

source: Why not check that our application works? Run the Quarkus development server with:
ja_jp: アプリケーションが動作することを確認してみましょう。次のようにQuarkusの開発サーバーを起動してください。 :

source: Why not run everything on virtual threads?
ja_jp: すべてを仮想スレッドで実行しない理由

source: Why should I care?
ja_jp: なぜ重要なのでしょうか?

source: Why use Java for AI?
ja_jp: AIにJavaを使用する理由

source: Why use Quarkus for AI-Infused Applications
ja_jp: AI搭載アプリケーションにQuarkusを使用する理由

source: Why use STM with Quarkus?
ja_jp: なぜ Quarkus で STM を使うのか?

source: Why would I want to write an extension?
ja_jp: エクステンションを作成すべき理由

source: Why would you try to load a non-existing class? That's a good question.
ja_jp: なぜ存在しないクラスをロードしようとするのでしょうか？それは良い質問です。

source: Why?
ja_jp: なぜか？

source: Wider Quarkus Ecosystem Support in the Dev Tools
ja_jp: 開発ツールにおけるQuarkusエコシステムのサポートの拡大

source: WildFly Feature Pack for seamless Jakarta EE integration
ja_jp: シームレスな Jakarta EE 統合のための WildFly Feature Pack

source: Will be <<json,mapped from JSON to that type>>
ja_jp: <<json,mapped from JSON to that type>> になります。

source: Will be xref:json[mapped from JSON to that type]
ja_jp: xref:json[JSONからその型にマッピング] されます。

source: Will include the `Cache-Control: max-age=1` header when `/paths/order` is requested.
ja_jp: `/paths/order` が要求されたときに `Cache-Control: max-age=1` ヘッダを含めます。

source: Will the Quarkus team accept my extension?
ja_jp: Quarkusチームは私のエクステンションを受け入れますか?

source: Willingness to pragmatically bend, a little, specifications when they would work against the Quarkus values
ja_jp: Quarkus の価値観に反するような仕様であっても、現実的に少しでも曲げようとする姿勢

source: Windows x86 32 bits
ja_jp: Windows x86 32 ビット

source: Windows x86 64 bits
ja_jp: Windows x86 64 ビット

source: Winning role-based policy can map the `SecurityIdentity` roles to the deployment-specific roles. These roles are then applicable for endpoint authorization by using the `@RolesAllowed` annotation.
ja_jp: 優先されるロールベースのポリシーは、 `SecurityIdentity` ロールをデプロイメント固有のロールにマッピングできます。 これらのロールは、 `@RolesAllowed` アノテーションを使用してエンドポイント認可に適用できます。

source: Wiring the Rule Unit with Quarkus CDI beans
ja_jp: Quarkus CDI Bean を使用したルールユニットの接続

source: With 1.10, we started to relax this rule for some carefully chosen properties and you can now override the following properties at runtime:
ja_jp: 1.10 では、慎重に選択したいくつかのプロパティーについてこのルールを緩和しました。以下のプロパティーを実行時にオーバーライドできるようになりました。

source: With <a href="https://code.quarkus.io/">code.quarkus.io</a>, in a few clicks, you can bootstrap your Quarkus application and discover its extension ecosystem.
ja_jp: <a href="https://code.quarkus.io/">code.quarkus.io</a>を使用すると、数回のクリックでQuarkusアプリケーションを起動し、そのエクステンションエコシステムを発見することができます。

source: With AMQP, we exchange http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#section-message-format[messages], which can have multiple _data_ sections (or multiple AMQP sequences, or a single AMQP value section). In our application, as we are exchanging `Movie` object, it encodes the instances as JSON and transfers it in a single _data_ section. The `content-type` header is set to `application/json`.
ja_jp: AMQPでは、複数の _データ_ セクション(または複数のAMQPシーケンス、または単一のAMQP値セクション)を持つことができる link:http://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#section-message-format[メッセージ] を交換します。私たちのアプリケーションでは、 `Movie` オブジェクトを交換しているので、インスタンスを JSON としてエンコードし、単一の _データ_ セクションで転送しています。 `content-type` ヘッダは `application/json` です。

source: With AOT support, Quarkus expands its runtime flexibility: plain JVM, Leyden-optimized JVM, and native image.
ja_jp: AOT サポートにより、Quarkus はそのランタイムの柔軟性を拡張します。プレーンな JVM、Leyden 最適化 JVM、そしてネイティブイメージです。

source: With Docker installed, these steps are simple:
ja_jp: Dockerがインストールされていれば、これらの手順は簡単です：

source: With Docker installed, you can now push the image and release it:
ja_jp: Dockerがインストールされたので、イメージをプッシュしてリリースすることができます。

source: With Environment Variables
ja_jp: 環境変数を使用

source: With Exception bubbling up
ja_jp: 例外をバブルアップ

source: With Funqy, a function is just:
ja_jp: Funqyでは、関数は単に次のようになります。

source: With Gradle, this is done by adding the following line to the `build.gradle` file:
ja_jp: Gradleでは、 `build.gradle` ファイルに以下の行を追加することで実現します:

source: With Gradle, use the following configuration:
ja_jp: Gradle では、以下の設定を使用します。

source: With HTTP/REST, applications are structured around resources/endpoints that handle various HTTP methods and paths. Client interaction occurs through emitting HTTP requests with appropriate methods and paths, following a request-response pattern. The server routes incoming requests to corresponding handlers based on path, method, and headers and then replies with a well-defined response.
ja_jp: HTTP/REST では、アプリケーションはリソース/エンドポイントを中心に構成され、さまざまな HTTP メソッドやパスを処理します。 クライアントとのやり取りは、適切なメソッドとパスを指定した HTTP リクエストを送信することで行われ、リクエスト/レスポンスのパターンに従います サーバーは、パス、メソッド、ヘッダーに基づいて、受信したリクエストを対応するハンドラーにルーティングし、明確に定義されたレスポンスで返します。

source: With Hibernate ORM, the Hibernate layer automatically picks up the datasource and uses it.
ja_jp: Hibernate ORMを使用する場合、Hibernateレイヤーは自動的にデータソースを選択し、それを使用します。

source: With Injected JWTParser
ja_jp: インジェクションされたJWTParserで

source: With JSON serialization correctly configured, you can also use `Publisher<Fruit>` and `Emitter<Fruit>`.
ja_jp: JSON シリアライゼーションが正しく設定されている場合は、 `Publisher<Fruit>` と `Emitter<Fruit>` も使用できます。

source: With Maven, add the following configuration:
ja_jp: Maven では、以下の設定を追加します。

source: With Maven, the full flow is a single command:
ja_jp: Maven では、完全なフローは単一のコマンドです。

source: With OpenTelemetry, metrics, traces and logs can be created and sent to the Grafana LGTM Dev Service.
ja_jp: OpenTelemetry を使用すると、メトリクス、トレース、ログを作成し、Grafana LGTM Dev Service に送信できます。

source: With Panache, the <code>Element</code> class would be as simple as:
ja_jp: Panacheでは、<code>Element</code>クラスは、次のように簡単です。

source: With Panache, we took an opinionated approach to tackle all these problems:
ja_jp: Panacheでは、これらの問題に対して、定見に基づいたアプローチをとりました:

source: With Quarkus 1.10.2, it's now working in native mode!
ja_jp: Quarkus 1.10.2では、ネイティブモードで動作するようになりました!

source: With Quarkus 2 approaching its imminent release and we passed 50 episodes of Quarkus Insights we want to do Q&A episode similar to what we did earlier in the year.
ja_jp: Quarkus 2のリリースが近づき、Quarkus Insightsのエピソードが50回を超えたので、今年の初めに行ったのと同じようなQ&A エピソードを行いたいと思います。

source: With Quarkus 2.2, the dispatching strategy of RESTEasy _reactive_ becomes smarter thus improving the developer experience.
ja_jp: Quarkus 2.2では、RESTEasy _reactive_ のディスパッチ戦略がよりスマートになり、開発者のエクスペリエンスが向上しました。

source: With Quarkus 2.9, compression support has been added to Reactive Routes and RESTEasy Reactive. Body of HTTP responses can now be compressed with both these components.
ja_jp: Quarkus 2.9では、Reactive RoutesとRESTEasy Reactiveに圧縮のサポートが追加されました。これらのコンポーネントで、HTTPレスポンスのボディを圧縮できるようになりました。

source: With Quarkus 3 finally out, we will be returning to our regular, continuous cadence of releasing approximately every five weeks. This provides a delivery train of small incremental changes that are easy to adopt and upgrade to.
ja_jp: Quarkus 3がついにリリースされ、私たちは、およそ5週間ごとにリリースするという、通常の継続的な流れに戻ることになります。これにより、採用やアップグレードが容易な、小さなインクリメンタルな変更のデリバリートレインが提供されます。

source: With Quarkus 3, due mainly to the package changes in many of the core dependencies, we are happy to say that lots of those extensions have already been updated to work with Quarkus 3.0. We are working with the maintainers of the remaining extensions to get them updated as well.
ja_jp: Quarkus 3では、主にコアの依存関係の多くでパッケージが変更されたため、多くのエクステンションがQuarkus 3.0で動作するようにすでに更新されています。私たちは、残りのエクステンションのメンテナと協力して、それらのエクステンションも更新するよう努力しています。

source: With Quarkus 3.31, you shouldn't be limited by the number of CDI beans anymore.
ja_jp: Quarkus 3.31では、CDI Beanの数によって制限されることはもうありません。

source: With Quarkus Messaging Pulsar extension (`quarkus-messaging-pulsar`) Dev Services for Pulsar automatically starts a Pulsar broker in dev mode and when running tests. So, you don't have to start a broker manually. The application is configured automatically.
ja_jp: Quarkus Messaging Pulsar エクステンション (`quarkus-messaging-pulsar`) を使用すると、Dev Services for Pulsar が開発モードおよびテスト実行時に自動で Pulsar ブローカーを起動します。 そのため、ブローカーを手動で起動する必要はありません。 また、アプリケーションの設定も自動的に行われます。

source: With Quarkus Messaging Pulsar extension (quarkus-messaging-pulsar) Dev Services for Pulsar automatically starts a Pulsar broker in dev mode and when running tests.
ja_jp: Quarkus Messaging Pulsarエクステンション（quarkus-messaging-pulsar）を使用すると、Pulsar向けDev Servicesが、開発モード時やテスト実行時に自動的にPulsarブローカーを起動します。

source: With Quarkus Smallrye Reactive Messaging Pulsar extension (quarkus-smallrye-reactive-messaging-pulsar) Dev Services for Pulsar automatically starts a Pulsar broker in dev mode and when running tests.
ja_jp: Quarkus Smallrye Reactive Messaging Pulsarエクステンション（quarkus-smallrye-reactive-messaging-pulsar）を使用すると、Pulsar用Dev Servicesが、開発モード時やテスト実行時に自動的にPulsarブローカーを起動します。

source: With Quarkus `web-app` applications, only the `IdToken` is verified by default because the access token is not used to access the current Quarkus web-app endpoint and is intended to be propagated to the services expecting this access token. If you expect the access token to contain the roles required to access the current Quarkus endpoint (`quarkus.oidc.roles.source=accesstoken`), then it will also be verified.
ja_jp: Quarkus の `web-app` アプリケーションでは、アクセストークンは現在の Quarkus の web-app エンドポイントへのアクセスには使用されず、このアクセストークンを必要とするサービスに伝播されることが意図されているため、デフォルトでは `IdToken` のみが検証されます。 アクセストークンに現在の Quarkus エンドポイント (`quarkus.oidc.roles.source=accesstoken`) にアクセスするために必要なロールが含まれていることが予想される場合は、それも検証されます。

source: With Quarkus you can deploy your favorite Java HTTP frameworks as AWS Lambda's using either the https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] or https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API]. This means that you can deploy your microservices written with Quarkus REST (our Jakarta REST implementation), Undertow (servlet), Reactive Routes, xref:funqy-http.adoc[Funqy HTTP] or any other Quarkus HTTP framework as an AWS Lambda.
ja_jp: Quarkus を使用すると、 https://docs.aws.amazon.com/apigateway/latest/developerguide/http-api.html[AWS Gateway HTTP API] または https://docs.aws.amazon.com/apigateway/latest/developerguide/apigateway-rest-api.html[AWS Gateway REST API]を使用して、 お気に入りの Java HTTP フレームワークを AWS Lambda としてデプロイできます。 これは、Quarkus REST(Jakarta REST 実装)、Undertow (サーブレット)、Reactive Routes、xref:funqy-http.adoc[Funqy HTTP]、または AWS Lambda としてのその他の Quarkus HTTP フレームワークで記述されたマイクロサービスをデプロイできることを意味します
